package main

import "fmt"

func main() {

	msg := fmt.Sprintf("%.2f%%", 0.344)
	fmt.Println(msg)

	//针对召唤兽的属性计算，我们整理了以下几个关键公式：
	//
	//召唤兽的气血值计算：
	//
	//气血 = 等级 * 体力资质 / 1000 + 体质点数 * 成长 * 6;
	//召唤兽的魔法值计算：
	//
	//魔法 = 等级 * 法力资质 / 500 + 法力点数 * 成长 * 3;
	//召唤兽的伤害值计算：
	//
	//伤害 = 等级 * 攻击资质 * (14 + 10 * 成长) / 7500 + 力量点数 * 成长;
	//召唤兽的防御值计算：
	//
	//防御 = 等级 * 防御资质 * (9.4 + 19 / 3 * 成长) / 7500 + 耐力点数 * 成长 * 4 / 3;
	//召唤兽的速度值计算：
	//
	//速度 = 敏捷点数 * 速度资质 / 1000;
	//召唤兽的灵力值计算：
	//
	//灵力 = 等级 * (法力资质 + 1662) * (1 + 成长) / 7500 + 体质点数 * 0.3 + 耐力点数 * 0.2 + 力量点数 * 0.4 + 法力点数 * 0.7;

	fmt.Println("1点力量增加伤害：", CalcAttack(1))
}

func CalcAttack(power int) float32 {

	// 伤害 = 等级 * 攻击资质 * (14 + 10 * 成长) / 7500 + 力量点数 * 成长;
	var level = 180
	var attackAptitude = 1500
	var growth = 1.23

	return float32(level*attackAptitude)*float32(14+10*growth)/7500 + float32(power)*float32(growth)
}
